# **Setup**

In [2]:
%lsmagic

Available line magics:
%alias  %alias_magic  %autoawait  %autocall  %automagic  %autosave  %bookmark  %cd  %clear  %cls  %code_wrap  %colors  %conda  %config  %connect_info  %copy  %ddir  %debug  %dhist  %dirs  %doctest_mode  %echo  %ed  %edit  %env  %gui  %hist  %history  %killbgscripts  %ldir  %less  %load  %load_ext  %loadpy  %logoff  %logon  %logstart  %logstate  %logstop  %ls  %lsmagic  %macro  %magic  %mamba  %matplotlib  %micromamba  %mkdir  %more  %notebook  %page  %pastebin  %pdb  %pdef  %pdoc  %pfile  %pinfo  %pinfo2  %pip  %popd  %pprint  %precision  %prun  %psearch  %psource  %pushd  %pwd  %pycat  %pylab  %qtconsole  %quickref  %recall  %rehashx  %reload_ext  %ren  %rep  %rerun  %reset  %reset_selective  %rmdir  %run  %save  %sc  %set_env  %store  %sx  %system  %tb  %time  %timeit  %unalias  %unload_ext  %who  %who_ls  %whos  %xdel  %xmode

Available cell magics:
%%!  %%HTML  %%SVG  %%bash  %%capture  %%cmd  %%code_wrap  %%debug  %%file  %%html  %%javascript  %%js  %%latex  %%markdown  %%perl  %%prun  %%pypy  %%python  %%python2  %%python3  %%ruby  %%script  %%sh  %%svg  %%sx  %%system  %%time  %%timeit  %%writefile

Automagic is ON, % prefix IS NOT needed for line magics.

# **Connect Database**

In [4]:
# Activate SQL Extension in Jupyter Notebook
# %load_ext sql
%reload_ext sql

# Connect to PostgreSQL Database
%sql postgresql://postgres:password@localhost:5432/Summer_Olympics

Connecting to 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

# **Check Extensions**

In [37]:
%%sql 

-- Installed Extensions
SELECT extname
FROM pg_extension;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

4 rows affected.

+---------------+
|    extname    |
+---------------+
|    plpgsql    |
|    postgis    |
| fuzzystrmatch |
|    pg_trgm    |
+---------------+

In [38]:
%%sql 

-- Available Extensions
SELECT name
FROM pg_available_extensions;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

113 rows affected.

+------------------------------+
|             name             |
+------------------------------+
|     address_standardizer     |
| address_standardizer_data_us |
|          adminpack           |
|           amcheck            |
|           autoinc            |
|            bloom             |
|         bool_plperl          |
|         bool_plperlu         |
|          btree_gin           |
|          btree_gist          |
+------------------------------+
Truncated to displaylimit of 10.

# **01 Window Function**

## **ROW_NUMBER**

### **Query 01**

* Assign Row Numbers In Default Row Sequence

In [4]:
%%sql
-- Assign Row Numbers using window function

SELECT "Year","Event","Country","Medal",
    ROW_NUMBER() OVER() AS "Row_N"
FROM summer
WHERE "Medal" = 'Gold'
LIMIT 10;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

10 rows affected.

+------+----------------------------+---------+-------+-------+
| Year |           Event            | Country | Medal | Row_N |
+------+----------------------------+---------+-------+-------+
| 1896 |       100M Freestyle       |   HUN   |  Gold |   1   |
| 1896 | 100M Freestyle For Sailors |   GRE   |  Gold |   2   |
| 1896 |      1200M Freestyle       |   HUN   |  Gold |   3   |
| 1896 |       400M Freestyle       |   AUT   |  Gold |   4   |
| 1896 |            100M            |   USA   |  Gold |   5   |
| 1896 |        110M Hurdles        |   USA   |  Gold |   6   |
| 1896 |           1500M            |   AUS   |  Gold |   7   |
| 1896 |            400M            |   USA   |  Gold |   8   |
| 1896 |            800M            |   AUS   |  Gold |   9   |
| 1896 |        Discus Throw        |   USA   |  Gold |   10  |
+------+----------------------------+---------+-------+-------+
Truncated to displaylimit of 10.

### **Query 02**

* Assign Row Numbers Based on Ascending Order of A Specified Column

In [15]:
%%sql 
-- Assign a number to each year in which Summer Olympic games were held

SELECT
  "Year",
  -- Assign numbers to each year
  ROW_NUMBER() OVER() AS Row_N
FROM (
        SELECT DISTINCT "Year"
        FROM summer
        ORDER BY "Year" ASC
        ) AS "Years"
ORDER BY "Year" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

27 rows affected.

+------+-------+
| Year | row_n |
+------+-------+
| 1896 |   1   |
| 1900 |   2   |
| 1904 |   3   |
| 1908 |   4   |
| 1912 |   5   |
| 1920 |   6   |
| 1924 |   7   |
| 1928 |   8   |
| 1932 |   9   |
| 1936 |   10  |
+------+-------+
Truncated to displaylimit of 10.

### **Query 03**

* Assign Row Numbers Based On Descending order of a specified column

In [20]:
%%sql
-- Assign the lowest numbers to the most recent years (Reverse Order)
-- Using ORDER BY Sub Clause of the WINDOW Function 

SELECT
  "Year",
  ROW_NUMBER() OVER (ORDER BY "Year" DESC) AS Row_N
FROM (
  SELECT DISTINCT "Year"
  FROM summer
) AS Years
ORDER BY "Year";

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

27 rows affected.

+------+-------+
| Year | row_n |
+------+-------+
| 1896 |   27  |
| 1900 |   26  |
| 1904 |   25  |
| 1908 |   24  |
| 1912 |   23  |
| 1920 |   22  |
| 1924 |   21  |
| 1928 |   20  |
| 1932 |   19  |
| 1936 |   18  |
+------+-------+
Truncated to displaylimit of 10.

### **Query 04**

* Use ORDER_BY() Clause In Window Function

In [16]:
%%sql

SELECT "Year","Event","Country","Medal",
    ROW_NUMBER() OVER(ORDER BY "Year" DESC) AS "Row_N"
FROM summer
WHERE "Medal" = 'Gold'
LIMIT 10;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

10 rows affected.

+------+--------------+---------+-------+-------+
| Year |    Event     | Country | Medal | Row_N |
+------+--------------+---------+-------+-------+
| 2012 | 10M Platform |   USA   |  Gold |   1   |
| 2012 |   Wg 84 KG   |   RUS   |  Gold |   2   |
| 2012 |   Wg 74 KG   |   RUS   |  Gold |   3   |
| 2012 |   Wg 66 KG   |   KOR   |  Gold |   4   |
| 2012 |   Wg 60 KG   |   IRI   |  Gold |   5   |
| 2012 |   Wg 55 KG   |   IRI   |  Gold |   6   |
| 2012 |  Wg 120 KG   |   CUB   |  Gold |   7   |
| 2012 |   Wf 96 KG   |   USA   |  Gold |   8   |
| 2012 |   Wf 84 KG   |   AZE   |  Gold |   9   |
| 2012 |   Wf 74 KG   |   USA   |  Gold |   10  |
+------+--------------+---------+-------+-------+
Truncated to displaylimit of 10.

### **Query 05**
* Use ORDER BY Clause For Multiple Columns

In [41]:
%%sql

SELECT "Year","Event","Country","Medal",
    ROW_NUMBER() OVER(ORDER BY "Year" DESC, "Event" ASC) AS "Row_N"
FROM summer
WHERE "Medal" = 'Gold'
LIMIT 10;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

10 rows affected.

+------+---------+---------+-------+-------+
| Year |  Event  | Country | Medal | Row_N |
+------+---------+---------+-------+-------+
| 2012 | - 48 KG |   BRA   |  Gold |   1   |
| 2012 | - 49 KG |   CHN   |  Gold |   2   |
| 2012 | - 58 KG |   ESP   |  Gold |   3   |
| 2012 | - 60 KG |   RUS   |  Gold |   4   |
| 2012 |  -56KG  |   PRK   |  Gold |   5   |
| 2012 | + 100KG |   FRA   |  Gold |   6   |
| 2012 | + 67 KG |   SRB   |  Gold |   7   |
| 2012 |  + 78KG |   CUB   |  Gold |   8   |
| 2012 | + 80 KG |   ITA   |  Gold |   9   |
| 2012 |  + 91KG |   GBR   |  Gold |   10  |
+------+---------+---------+-------+-------+
Truncated to displaylimit of 10.

## **COUNT Function**

In [21]:
%%sql 
-- Count the number of medals each athlete has earned

SELECT
  -- Count the number of medals each athlete has earned
  DISTINCT "Athlete",
  COUNT("Medal") AS "Medals"
FROM summer
GROUP BY "Athlete"
ORDER BY "Medals" DESC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

22762 rows affected.

+---------------------+--------+
|       Athlete       | Medals |
+---------------------+--------+
|    PHELPS Michael   |   22   |
|   LATYNINA Larisa   |   18   |
|  ANDRIANOV Nikolay  |   15   |
| MANGIAROTTI Edoardo |   13   |
|     ONO Takashi     |   13   |
|    SHAKHLIN Boris   |   13   |
|   COUGHLIN Natalie  |   12   |
|    FISCHER Birgit   |   12   |
|      KATO Sawao     |   12   |
|     NEMOV Alexei    |   12   |
+---------------------+--------+
Truncated to displaylimit of 10.

In [25]:
%%sql
-- Return each year's gold medalists in the Men's 69KG weightlifting competition.

SELECT
  -- Return each year's champions' countries
  "Year",
  "Country" AS "champion"
FROM summer
WHERE
  "Discipline" = 'Weightlifting' AND
  "Event" = '69KG' AND
  "Gender" = 'Men' AND
  "Medal" = 'Gold';

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

4 rows affected.

+------+----------+
| Year | champion |
+------+----------+
| 2000 |   BUL    |
| 2004 |   CHN    |
| 2008 |   CHN    |
| 2012 |   CHN    |
+------+----------+

## **LAG Function**

In [26]:
%%sql

-- Compare Reigning Champion
SELECT "Year","Country" AS "Current_Champion"
FROM summer
WHERE "Gender" = 'Men'
    AND "Medal" = 'Gold'
    AND "Event" = 'Discus Throw'

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

27 rows affected.

+------+------------------+
| Year | Current_Champion |
+------+------------------+
| 1896 |       USA        |
| 1900 |       HUN        |
| 1904 |       USA        |
| 1908 |       USA        |
| 1912 |       FIN        |
| 1920 |       FIN        |
| 1924 |       USA        |
| 1928 |       USA        |
| 1932 |       USA        |
| 1936 |       USA        |
+------+------------------+
Truncated to displaylimit of 10.

In [30]:
%%sql

-- Create CTE 
WITH discus_gold AS (
    SELECT "Year","Country" AS "Current_Champion"
    FROM summer
    WHERE "Gender" = 'Men'
        AND "Medal" = 'Gold'
        AND "Event" = 'Discus Throw'
)

-- Get Current Champion & Compare To CTE Table
SELECT "Year","Current_Champion",
    LAG("Current_Champion",1) OVER (ORDER BY "Year" ASC) AS "Previous Champion"
FROM discus_gold
ORDER BY "Year" ASC

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

27 rows affected.

+------+------------------+-------------------+
| Year | Current_Champion | Previous Champion |
+------+------------------+-------------------+
| 1896 |       USA        |        None       |
| 1900 |       HUN        |        USA        |
| 1904 |       USA        |        HUN        |
| 1908 |       USA        |        USA        |
| 1912 |       FIN        |        USA        |
| 1920 |       FIN        |        FIN        |
| 1924 |       USA        |        FIN        |
| 1928 |       USA        |        USA        |
| 1932 |       USA        |        USA        |
| 1936 |       USA        |        USA        |
+------+------------------+-------------------+
Truncated to displaylimit of 10.

## **PARTITION BY**

### **Query 01**

* Partition By Single Column

In [41]:
%%sql 

SELECT DISTINCT "Gender", "Year", "Country"
FROM summer
WHERE "Year" >= 2000 AND
    "Event" = 'Javelin Throw' AND
    "Medal" = 'Gold'

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

8 rows affected.

+--------+------+---------+
| Gender | Year | Country |
+--------+------+---------+
|  Men   | 2000 |   CZE   |
|  Men   | 2004 |   NOR   |
|  Men   | 2008 |   NOR   |
|  Men   | 2012 |   TTO   |
| Women  | 2000 |   NOR   |
| Women  | 2004 |   CUB   |
| Women  | 2008 |   CZE   |
| Women  | 2012 |   CZE   |
+--------+------+---------+

In [43]:
%%sql

-- CTE Table
WITH Tennis_Gold AS (
  SELECT DISTINCT
    "Gender", "Year", "Country"
  FROM summer
  WHERE
    "Year" >= 2000 AND
    "Event" = 'Javelin Throw' AND
    "Medal" = 'Gold')

SELECT
  "Gender", "Year",
  "Country" AS Champion,
  -- Fetch the previous years champion by gender
  LAG("Country") OVER (PARTITION BY "Gender"
            ORDER BY "Year" ASC) AS Last_Champion
FROM Tennis_Gold
ORDER BY "Gender" ASC, "Year" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

8 rows affected.

+--------+------+----------+---------------+
| Gender | Year | champion | last_champion |
+--------+------+----------+---------------+
|  Men   | 2000 |   CZE    |      None     |
|  Men   | 2004 |   NOR    |      CZE      |
|  Men   | 2008 |   NOR    |      NOR      |
|  Men   | 2012 |   TTO    |      NOR      |
| Women  | 2000 |   NOR    |      None     |
| Women  | 2004 |   CUB    |      NOR      |
| Women  | 2008 |   CZE    |      CUB      |
| Women  | 2012 |   CZE    |      CZE      |
+--------+------+----------+---------------+

### **Query 02**

* Partition By Multiple Column

In [45]:
%%sql 

WITH Athletics_Gold AS (
  SELECT DISTINCT
    "Gender", "Year", "Event", "Country"
  FROM summer
  WHERE
    "Year" >= 2000 AND
    "Discipline" = 'Athletics' AND
    "Event" IN ('100M', '10000M') AND
    "Medal" = 'Gold')

SELECT
  "Gender", "Year", "Event",
  "Country" AS Champion,
  -- Fetch the previous years champion by gender and event
  LAG("Country") OVER (PARTITION BY "Gender","Event"
            ORDER BY "Year" ASC) AS Last_Champion
FROM Athletics_Gold
ORDER BY "Event" ASC, "Gender" ASC, "Year" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

15 rows affected.

+--------+------+--------+----------+---------------+
| Gender | Year | Event  | champion | last_champion |
+--------+------+--------+----------+---------------+
|  Men   | 2000 | 10000M |   ETH    |      None     |
|  Men   | 2004 | 10000M |   ETH    |      ETH      |
|  Men   | 2008 | 10000M |   ETH    |      ETH      |
|  Men   | 2012 | 10000M |   GBR    |      ETH      |
| Women  | 2000 | 10000M |   ETH    |      None     |
| Women  | 2004 | 10000M |   CHN    |      ETH      |
| Women  | 2008 | 10000M |   ETH    |      CHN      |
| Women  | 2012 | 10000M |   ETH    |      ETH      |
|  Men   | 2000 |  100M  |   USA    |      None     |
|  Men   | 2004 |  100M  |   USA    |      USA      |
+--------+------+--------+----------+---------------+
Truncated to displaylimit of 10.

# **02 Fetch, Rank & Page**

## **Fetch Functions**

* Lag
* Lead
* First_Value
* Last_Value

### **LAG**

In [39]:
%%sql 

SELECT DISTINCT "Year", "City"
FROM summer
ORDER BY "Year"
LIMIT 5

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

5 rows affected.

+------+-----------+
| Year |    City   |
+------+-----------+
| 1896 |   Athens  |
| 1900 |   Paris   |
| 1904 |  St Louis |
| 1908 |   London  |
| 1912 | Stockholm |
+------+-----------+

In [40]:
%%sql 
-- Query the host city for each summer olympics along with the previous host city

-- CTE Table
WITH Hosts AS (
    SELECT DISTINCT "Year", "City"
    FROM summer
    ORDER BY "Year")

-- Main Query
SELECT "Year", "City" AS "Current_City",
        LAG("City",1) OVER () AS "Previous_City"
FROM Hosts
ORDER BY "Year";

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

27 rows affected.

+------+--------------+---------------+
| Year | Current_City | Previous_City |
+------+--------------+---------------+
| 1896 |    Athens    |      None     |
| 1900 |    Paris     |     Athens    |
| 1904 |   St Louis   |     Paris     |
| 1908 |    London    |    St Louis   |
| 1912 |  Stockholm   |     London    |
| 1920 |   Antwerp    |   Stockholm   |
| 1924 |    Paris     |    Antwerp    |
| 1928 |  Amsterdam   |     Paris     |
| 1932 | Los Angeles  |   Amsterdam   |
| 1936 |    Berlin    |  Los Angeles  |
+------+--------------+---------------+
Truncated to displaylimit of 10.

### **LEAD**

In [33]:
%%sql 

WITH Hosts AS (SELECT DISTINCT "Year", "City"
                FROM summer)

SELECT "Year", "City",
    LEAD("City", 1) OVER (ORDER BY "Year" ASC) AS Next_City,
    LEAD("City", 2) OVER (ORDER BY "Year" ASC) AS After_Next_City
FROM Hosts
ORDER BY "Year" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

27 rows affected.

+------+-------------+-------------+-----------------+
| Year |     City    |  next_city  | after_next_city |
+------+-------------+-------------+-----------------+
| 1896 |    Athens   |    Paris    |     St Louis    |
| 1900 |    Paris    |   St Louis  |      London     |
| 1904 |   St Louis  |    London   |    Stockholm    |
| 1908 |    London   |  Stockholm  |     Antwerp     |
| 1912 |  Stockholm  |   Antwerp   |      Paris      |
| 1920 |   Antwerp   |    Paris    |    Amsterdam    |
| 1924 |    Paris    |  Amsterdam  |   Los Angeles   |
| 1928 |  Amsterdam  | Los Angeles |      Berlin     |
| 1932 | Los Angeles |    Berlin   |      London     |
| 1936 |    Berlin   |    London   |     Helsinki    |
+------+-------------+-------------+-----------------+
Truncated to displaylimit of 10.

### **FIRST & LAST VALUE**

In [48]:
%%sql 
-- Query the Current Host City along with the first and last host city

-- CTE
WITH Hosts AS (SELECT DISTINCT "Year", "City" FROM summer)

SELECT "Year", "City",
    FIRST_VALUE("City") OVER (ORDER BY "Year" ASC) AS First_City,
    LAST_VALUE("City") OVER (
                            ORDER BY "Year" ASC
                            RANGE BETWEEN
                            UNBOUNDED PRECEDING AND
                            UNBOUNDED FOLLOWING
                            ) AS Last_City
FROM Hosts
ORDER BY "Year" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

27 rows affected.

+------+-------------+------------+-----------+
| Year |     City    | first_city | last_city |
+------+-------------+------------+-----------+
| 1896 |    Athens   |   Athens   |   London  |
| 1900 |    Paris    |   Athens   |   London  |
| 1904 |   St Louis  |   Athens   |   London  |
| 1908 |    London   |   Athens   |   London  |
| 1912 |  Stockholm  |   Athens   |   London  |
| 1920 |   Antwerp   |   Athens   |   London  |
| 1924 |    Paris    |   Athens   |   London  |
| 1928 |  Amsterdam  |   Athens   |   London  |
| 1932 | Los Angeles |   Athens   |   London  |
| 1936 |    Berlin   |   Athens   |   London  |
+------+-------------+------------+-----------+
Truncated to displaylimit of 10.

### **PARTITION With LEAD Value**

In [97]:
%%sql 

SELECT * 
FROM summer 
WHERE "Event" IN ('Discus Throw')
        AND "Medal" = 'Gold'
        AND "Gender" = 'Men'
ORDER BY "Year"
LIMIT 5

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

5 rows affected.

+------+-----------+-----------+------------+----------------------+---------+--------+--------------+-------+
| Year |    City   |   Sport   | Discipline |       Athlete        | Country | Gender |    Event     | Medal |
+------+-----------+-----------+------------+----------------------+---------+--------+--------------+-------+
| 1896 |   Athens  | Athletics | Athletics  |    GARRETT Robert    |   USA   |  Men   | Discus Throw |  Gold |
| 1900 |   Paris   | Athletics | Athletics  |     BAUER Rudolf     |   HUN   |  Men   | Discus Throw |  Gold |
| 1904 |  St Louis | Athletics | Athletics  |   SHERIDAN Martin    |   USA   |  Men   | Discus Throw |  Gold |
| 1908 |   London  | Athletics | Athletics  |   SHERIDAN Martin    |   USA   |  Men   | Discus Throw |  Gold |
| 1912 | Stockholm | Athletics | Athletics  | TAIPALE Armas Rudolf |   FIN   |  Men   | Discus Throw |  Gold |
+------+-----------+-----------+------------+----------------------+---------+--------+--------------+-------+

In [96]:
%%sql 

SELECT * 
FROM summer 
WHERE "Event" IN ('Discus Throw')
        AND "Medal" = 'Gold'
        AND "Gender" = 'Men'
ORDER BY "Year" DESC
LIMIT 5

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

5 rows affected.

+------+---------+-----------+------------+-------------------+---------+--------+--------------+-------+
| Year |   City  |   Sport   | Discipline |      Athlete      | Country | Gender |    Event     | Medal |
+------+---------+-----------+------------+-------------------+---------+--------+--------------+-------+
| 2012 |  London | Athletics | Athletics  |   HARTING Robert  |   GER   |  Men   | Discus Throw |  Gold |
| 2008 | Beijing | Athletics | Athletics  |    KANTER Gerd    |   EST   |  Men   | Discus Throw |  Gold |
| 2004 |  Athens | Athletics | Athletics  | ALEKNA Virgilijus |   LTU   |  Men   | Discus Throw |  Gold |
| 2000 |  Sydney | Athletics | Athletics  | ALEKNA Virgilijus |   LTU   |  Men   | Discus Throw |  Gold |
| 1996 | Atlanta | Athletics | Athletics  |    RIEDEL Lars    |   GER   |  Men   | Discus Throw |  Gold |
+------+---------+-----------+------------+-------------------+---------+--------+--------------+-------+

In [91]:
%%sql 

SELECT "Year","Event","Athlete",
        "Country" AS "Current Champion",
        LEAD("Country",1) OVER(PARTITION BY "Event") AS "Next Champion"
FROM summer
WHERE "Event" IN ('Discus Throw')
        AND "Medal" = 'Gold'
ORDER BY "Year" ASC

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

47 rows affected.

+------+--------------+----------------------------+------------------+---------------+
| Year |    Event     |          Athlete           | Current Champion | Next Champion |
+------+--------------+----------------------------+------------------+---------------+
| 1896 | Discus Throw |       GARRETT Robert       |       USA        |      HUN      |
| 1900 | Discus Throw |        BAUER Rudolf        |       HUN        |      USA      |
| 1904 | Discus Throw |      SHERIDAN Martin       |       USA        |      USA      |
| 1908 | Discus Throw |      SHERIDAN Martin       |       USA        |      FIN      |
| 1912 | Discus Throw |    TAIPALE Armas Rudolf    |       FIN        |      FIN      |
| 1920 | Discus Throw | NIKLANDER Elmer Konstantin |       FIN        |      USA      |
| 1924 | Discus Throw |   HOUSER Lemuel Clarence   |       USA        |      USA      |
| 1928 | Discus Throw |   HOUSER Lemuel Clarence   |       USA        |      POL      |
| 1928 | Discus Throw |      KONOPACKA Halina      |       POL        |      USA      |
| 1932 | Discus Throw |   ANDERSON John Franklin   |       USA        |      USA      |
+------+--------------+----------------------------+------------------+---------------+
Truncated to displaylimit of 10.

### **PARTITION With FIRST/LAST Value**

In [104]:
%%sql 

SELECT "Year","Event","Athlete","Gender",
        "Country" AS "Current Champion",
        LAG("Country",1) OVER(PARTITION BY "Event") AS "Previous Champion",
        LEAD("Country",1) OVER(PARTITION BY "Event") AS "Next Champion",
        FIRST_VALUE("Country") OVER(PARTITION BY "Event") AS "First Champion",
        LAST_VALUE("Country") OVER(PARTITION BY "Event") AS "Last Champion"
FROM summer
WHERE "Event" IN ('Discus Throw')
        AND "Medal" = 'Gold'
        AND "Gender" = 'Men'
ORDER BY "Year" ASC

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

27 rows affected.

+------+--------------+----------------------------+--------+------------------+-------------------+---------------+----------------+---------------+
| Year |    Event     |          Athlete           | Gender | Current Champion | Previous Champion | Next Champion | First Champion | Last Champion |
+------+--------------+----------------------------+--------+------------------+-------------------+---------------+----------------+---------------+
| 1896 | Discus Throw |       GARRETT Robert       |  Men   |       USA        |        None       |      HUN      |      USA       |      GER      |
| 1900 | Discus Throw |        BAUER Rudolf        |  Men   |       HUN        |        USA        |      USA      |      USA       |      GER      |
| 1904 | Discus Throw |      SHERIDAN Martin       |  Men   |       USA        |        HUN        |      USA      |      USA       |      GER      |
| 1908 | Discus Throw |      SHERIDAN Martin       |  Men   |       USA        |        USA        |      FIN      |      USA       |      GER      |
| 1912 | Discus Throw |    TAIPALE Armas Rudolf    |  Men   |       FIN        |        USA        |      FIN      |      USA       |      GER      |
| 1920 | Discus Throw | NIKLANDER Elmer Konstantin |  Men   |       FIN        |        FIN        |      USA      |      USA       |      GER      |
| 1924 | Discus Throw |   HOUSER Lemuel Clarence   |  Men   |       USA        |        FIN        |      USA      |      USA       |      GER      |
| 1928 | Discus Throw |   HOUSER Lemuel Clarence   |  Men   |       USA        |        USA        |      USA      |      USA       |      GER      |
| 1932 | Discus Throw |   ANDERSON John Franklin   |  Men   |       USA        |        USA        |      USA      |      USA       |      GER      |
| 1936 | Discus Throw | CARPENTER William Kenneth  |  Men   |       USA        |        USA        |      ITA      |      USA       |      GER      |
+------+--------------+----------------------------+--------+------------------+-------------------+---------------+----------------+---------------+
Truncated to displaylimit of 10.

## **Ranking Function**

### **ROW_NUMBER**

In [116]:
%%sql 
-- Query the number of games (Without Row Number)

SELECT "Country", COUNT(DISTINCT "Year") AS "Games"
FROM summer
WHERE "Country" IN ('GBR','DEN','FRA','ITA','AUT','BEL','NOR','POL','ESP')
GROUP BY "Country"
ORDER BY "Games" DESC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

9 rows affected.

+---------+-------+
| Country | Games |
+---------+-------+
|   GBR   |   27  |
|   FRA   |   26  |
|   DEN   |   26  |
|   ITA   |   25  |
|   AUT   |   24  |
|   BEL   |   24  |
|   NOR   |   22  |
|   POL   |   20  |
|   ESP   |   18  |
+---------+-------+

In [117]:
%%sql 
-- Query the number of games (With Row Number)

-- Define CTE 
WITH Country_Games_Count AS (
        SELECT "Country", COUNT(DISTINCT "Year") AS "Games"
        FROM summer
        WHERE "Country" IN ('GBR','DEN','FRA','ITA','AUT','BEL','NOR','POL','ESP')
        GROUP BY "Country"
        ORDER BY "Games" DESC)

-- Main Query With Rank Assignment
SELECT "Country", "Games",
        ROW_NUMBER() OVER(ORDER BY "Games" DESC) AS Rank
FROM Country_Games_Count
WHERE "Country" IN ('GBR','DEN','FRA','ITA','AUT','BEL','NOR','POL','ESP')
ORDER BY "Games" DESC, "Country" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

9 rows affected.

+---------+-------+------+
| Country | Games | rank |
+---------+-------+------+
|   GBR   |   27  |  1   |
|   DEN   |   26  |  3   |
|   FRA   |   26  |  2   |
|   ITA   |   25  |  4   |
|   AUT   |   24  |  5   |
|   BEL   |   24  |  6   |
|   NOR   |   22  |  7   |
|   POL   |   20  |  8   |
|   ESP   |   18  |  9   |
+---------+-------+------+

### **RANK**

In [119]:
%%sql 
-- Query the number of games (With Row Number & Rank)

-- Define CTE 
WITH Country_Games_Count AS (
        SELECT "Country", COUNT(DISTINCT "Year") AS "Games"
        FROM summer
        WHERE "Country" IN ('GBR','DEN','FRA','ITA','AUT','BEL','NOR','POL','ESP')
        GROUP BY "Country"
        ORDER BY "Games" DESC)

-- Main Query With Rank Assignment
SELECT "Country", "Games",
        ROW_NUMBER() OVER(ORDER BY "Games" DESC) AS Row_N,
        RANK() OVER(ORDER BY "Games" DESC) AS Rank
FROM Country_Games_Count
WHERE "Country" IN ('GBR','DEN','FRA','ITA','AUT','BEL','NOR','POL','ESP')
ORDER BY "Games" DESC, "Country" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

9 rows affected.

+---------+-------+-------+------+
| Country | Games | row_n | rank |
+---------+-------+-------+------+
|   GBR   |   27  |   1   |  1   |
|   DEN   |   26  |   3   |  2   |
|   FRA   |   26  |   2   |  2   |
|   ITA   |   25  |   4   |  4   |
|   AUT   |   24  |   5   |  5   |
|   BEL   |   24  |   6   |  5   |
|   NOR   |   22  |   7   |  7   |
|   POL   |   20  |   8   |  8   |
|   ESP   |   18  |   9   |  9   |
+---------+-------+-------+------+

In [120]:
'''  
NOTE: Row number is compare equal value & hence assigns different row numbers, 
    while the RANK function will assign the same rank to the same value
'''

'  \nNOTE: Row number is compare equal value & hence assigns different row numbers, \n    while the RANK function will assign the same rank to the same value\n'

### **DENSE_RANK**

In [122]:
%%sql 
-- Query the number of games (With Row Number & Rank)

-- Define CTE 
WITH Country_Games_Count AS (
        SELECT "Country", COUNT(DISTINCT "Year") AS "Games"
        FROM summer
        WHERE "Country" IN ('GBR','DEN','FRA','ITA','AUT','BEL','NOR','POL','ESP')
        GROUP BY "Country"
        ORDER BY "Games" DESC)

-- Main Query With Rank Assignment
SELECT "Country", "Games",
        ROW_NUMBER() OVER(ORDER BY "Games" DESC) AS Row_N, # Row Number
        RANK() OVER(ORDER BY "Games" DESC) AS Rank, # Rank
        DENSE_RANK() OVER(ORDER BY "Games" DESC) AS Dense_Rank # Dense Rank

FROM Country_Games_Count
WHERE "Country" IN ('GBR','DEN','FRA','ITA','AUT','BEL','NOR','POL','ESP')
ORDER BY "Games" DESC, "Country" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

9 rows affected.

+---------+-------+-------+------+------------+
| Country | Games | row_n | rank | dense_rank |
+---------+-------+-------+------+------------+
|   GBR   |   27  |   1   |  1   |     1      |
|   DEN   |   26  |   3   |  2   |     2      |
|   FRA   |   26  |   2   |  2   |     2      |
|   ITA   |   25  |   4   |  4   |     3      |
|   AUT   |   24  |   5   |  5   |     4      |
|   BEL   |   24  |   6   |  5   |     4      |
|   NOR   |   22  |   7   |  7   |     5      |
|   POL   |   20  |   8   |  8   |     6      |
|   ESP   |   18  |   9   |  9   |     7      |
+---------+-------+-------+------+------------+

### **Rank With Partitions**

## **Paging Functions**

In [127]:
%%sql 
# Without Paging 

SELECT DISTINCT "Discipline"
FROM summer;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

67 rows affected.

+---------------------+
|      Discipline     |
+---------------------+
| Wrestling Freestyle |
|       Archery       |
|       Baseball      |
|       Lacrosse      |
|         Judo        |
|      Athletics      |
|  Marathon swimming  |
|     Table Tennis    |
|       Cricket       |
|     Canoe Sprint    |
+---------------------+
Truncated to displaylimit of 10.

In [126]:
%%sql
# With Paging to split the data into chunks / pages

# Define CTE Table
WITH Disciplines AS (SELECT DISTINCT "Discipline" FROM summer)

# Main Query
SELECT "Discipline", 
        NTILE(15) OVER () AS "Page"
From Disciplines
ORDER BY "Page" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

67 rows affected.

+---------------------+------+
|      Discipline     | Page |
+---------------------+------+
| Wrestling Freestyle |  1   |
|       Archery       |  1   |
|       Baseball      |  1   |
|       Lacrosse      |  1   |
|         Judo        |  1   |
|      Athletics      |  2   |
|  Marathon swimming  |  2   |
|     Table Tennis    |  2   |
|       Cricket       |  2   |
|     Canoe Sprint    |  2   |
+---------------------+------+
Truncated to displaylimit of 10.

In [146]:
%%sql 

SELECT "Country", COUNT(*) AS "Medals"
FROM summer
GROUP BY "Country"

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

148 rows affected.

+---------+--------+
| Country | Medals |
+---------+--------+
|   ETH   |   45   |
|   KUW   |   2    |
|   None  |   4    |
|   NED   |  851   |
|   DEN   |  507   |
|   UAE   |   1    |
|   SIN   |   4    |
|   ALG   |   15   |
|   VEN   |   12   |
|   CUB   |  410   |
+---------+--------+
Truncated to displaylimit of 10.

In [163]:
%%sql
# Split the countries & their medal count into 3 subgroups

WITH Country_Medals AS (
                        SELECT "Country", COUNT(*) AS "Medals"
                        FROM summer
                        GROUP BY "Country")

SELECT "Country", "Medals",
        NTILE(3) OVER(ORDER BY "Medals" DESC) AS "Group"
FROM Country_Medals;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

148 rows affected.

+---------+--------+-------+
| Country | Medals | Group |
+---------+--------+-------+
|   USA   |  4585  |   1   |
|   URS   |  2049  |   1   |
|   GBR   |  1720  |   1   |
|   FRA   |  1396  |   1   |
|   GER   |  1305  |   1   |
|   ITA   |  1296  |   1   |
|   AUS   |  1189  |   1   |
|   HUN   |  1079  |   1   |
|   SWE   |  1044  |   1   |
|   NED   |  851   |   1   |
+---------+--------+-------+
Truncated to displaylimit of 10.

In [172]:
%%sql 
# Calculate the average medal count for each sub-group

WITH Country_Medals AS (
                        SELECT "Country", COUNT(*) AS "Medals"
                        FROM summer
                        GROUP BY "Country"),
Third AS (
        SELECT "Country", "Medals",
        NTILE(3) OVER(ORDER BY "Medals" DESC) AS "Group"
        FROM Country_Medals)

SELECT "Group" , ROUND(AVG("Medals"),2) AS "Average Medals"
FROM Third
GROUP BY "Group"

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

3 rows affected.

+-------+----------------+
| Group | Average Medals |
+-------+----------------+
|   1   |     598.74     |
|   2   |     22.98      |
|   3   |      2.08      |
+-------+----------------+

# **03 Aggregate Window Function**

* Framed Aggregation

## **Running Aggregation**

### **Query 01**

In [189]:
%%sql
# Gold Medal Tally For Brazil Since 1992

SELECT "Year", COUNT(*) AS "Medals"
FROM summer
WHERE "Country" = 'BRA'
    AND "Medal" = 'Gold'
    AND "Year" >= 1992
GROUP BY "Year"
ORDER BY "Year" ASC

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

5 rows affected.

+------+--------+
| Year | Medals |
+------+--------+
| 1992 |   13   |
| 1996 |   5    |
| 2004 |   18   |
| 2008 |   14   |
| 2012 |   14   |
+------+--------+

In [194]:
%%sql 

WITH Brazil_Medals AS (
    SELECT "Year", COUNT(*) AS "Medals"
    FROM summer
    WHERE "Country" = 'BRA'
        AND "Medal" = 'Gold'
        AND "Year" >= 1992
    GROUP BY "Year"
    ORDER BY "Year" ASC
)

SELECT MAX("Medals") AS Max_Medals,
    MIN("Medals") AS Min_Medals,
    SUM("Medals") AS Total_Medals,
    ROUND(AVG("Medals"),1) AS Avg_Medals

FROM Brazil_Medals;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

1 rows affected.

+------------+------------+--------------+------------+
| max_medals | min_medals | total_medals | avg_medals |
+------------+------------+--------------+------------+
|     18     |     5      |      64      |    12.8    |
+------------+------------+--------------+------------+

In [212]:
%%sql
# Query the Gold Medal Tally Of Brazil since 1991 against the Maximum Gold Medals Won By Brazil till date

WITH Brazil_Medals AS (
    SELECT "Year", COUNT(*) AS "Medals"
    FROM summer
    WHERE "Country" = 'BRA'
        AND "Medal" = 'Gold'
        AND "Year" >= 1992
    GROUP BY "Year"
    ORDER BY "Year" ASC)

SELECT "Year", "Medals",
    MIN("Medals") OVER (ORDER BY "Year" ASC) AS "Run_Medals_Min",
    MAX("Medals") OVER (ORDER BY "Year" ASC) AS "Run_Medals_Max",
    SUM("Medals") OVER (ORDER BY "Year" ASC) AS "Run_Medals_Sum",
    AVG("Medals") OVER (ORDER BY "Year" ASC) AS "Run_Medals_Avg"
FROM Brazil_Medals

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

5 rows affected.

+------+--------+----------------+----------------+----------------+---------------------+
| Year | Medals | Run_Medals_Min | Run_Medals_Max | Run_Medals_Sum |    Run_Medals_Avg   |
+------+--------+----------------+----------------+----------------+---------------------+
| 1992 |   13   |       13       |       13       |       13       | 13.0000000000000000 |
| 1996 |   5    |       5        |       13       |       18       |  9.0000000000000000 |
| 2004 |   18   |       5        |       18       |       36       | 12.0000000000000000 |
| 2008 |   14   |       5        |       18       |       50       | 12.5000000000000000 |
| 2012 |   14   |       5        |       18       |       64       | 12.8000000000000000 |
+------+--------+----------------+----------------+----------------+---------------------+

### **Query 02**

In [174]:
%%sql 
# Return the year, country, medals, and the maximum medals earned so far for each country, 
# ordered by year in ascending order. 

WITH Country_Medals AS (
  SELECT
    "Year", "Country", COUNT(*) AS "Medals"
  FROM summer
  WHERE
    "Country" IN ('CHN', 'KOR', 'JPN')
    AND "Medal" = 'Gold' AND "Year" >= 2000
  GROUP BY "Year", "Country")

SELECT
  -- Return the max medals earned so far per "country"
  "Year",
  "Country",
  "Medals",
  MAX("Medals") OVER (PARTITION BY "Country"
                ORDER BY "Year" ASC) AS Max_Medals
FROM Country_Medals
ORDER BY "Country" ASC, "Year" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

12 rows affected.

+------+---------+--------+------------+
| Year | Country | Medals | max_medals |
+------+---------+--------+------------+
| 2000 |   CHN   |   39   |     39     |
| 2004 |   CHN   |   52   |     52     |
| 2008 |   CHN   |   74   |     74     |
| 2012 |   CHN   |   56   |     74     |
| 2000 |   JPN   |   5    |     5      |
| 2004 |   JPN   |   21   |     21     |
| 2008 |   JPN   |   23   |     23     |
| 2012 |   JPN   |   7    |     23     |
| 2000 |   KOR   |   12   |     12     |
| 2004 |   KOR   |   14   |     14     |
+------+---------+--------+------------+
Truncated to displaylimit of 10.

### **Query 03** 

* Partioning With Aggregated Window Functions

In [220]:
%%sql

SELECT "Year","Country", "Medal"
FROM summer 
ORDER BY "Year","Country"

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

31165 rows affected.

+------+---------+--------+
| Year | Country | Medal  |
+------+---------+--------+
| 1896 |   AUS   |  Gold  |
| 1896 |   AUS   |  Gold  |
| 1896 |   AUT   | Silver |
| 1896 |   AUT   |  Gold  |
| 1896 |   AUT   | Bronze |
| 1896 |   AUT   |  Gold  |
| 1896 |   AUT   | Bronze |
| 1896 |   DEN   | Silver |
| 1896 |   DEN   | Silver |
| 1896 |   DEN   |  Gold  |
+------+---------+--------+
Truncated to displaylimit of 10.

In [20]:
%%sql 

-- CTE Table 
WITH Medals AS (
    SELECT "Year","Country", COUNT(*) AS "Medals"
    FROM summer
    GROUP BY "Country","Year"
    ORDER BY "Year","Country")

SELECT "Year", "Country", "Medals",
        SUM("Medals") OVER(ORDER BY "Country") AS "Total_Medals",  # Without Country Wise Partitioning
        SUM("Medals") OVER(ORDER BY "Country", "Year") AS "Total_Medals",
        SUM("Medals") OVER(PARTITION BY "Country" ORDER BY "Year") AS "Total_Medals_CW" # With Country Wise Partitioning
FROM Medals

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

1158 rows affected.

+------+---------+--------+--------------+----------------+-----------------+
| Year | Country | Medals | Total_Medals | Total_Medals_1 | Total_Medals_CW |
+------+---------+--------+--------------+----------------+-----------------+
| 2008 |   AFG   |   1    |      2       |       1        |        1        |
| 2012 |   AFG   |   1    |      2       |       2        |        2        |
| 1988 |   AHO   |   1    |      3       |       3        |        1        |
| 1984 |   ALG   |   2    |      18      |       5        |        2        |
| 1992 |   ALG   |   2    |      18      |       7        |        4        |
| 1996 |   ALG   |   3    |      18      |       10       |        7        |
| 2000 |   ALG   |   5    |      18      |       15       |        12       |
| 2008 |   ALG   |   2    |      18      |       17       |        14       |
| 2012 |   ALG   |   1    |      18      |       18       |        15       |
| 1908 |   ANZ   |   19   |      47      |       37       |        19       |
+------+---------+--------+--------------+----------------+-----------------+
Truncated to displaylimit of 10.

## **Sliding Frame Aggregation**

### **Query 01**

In [24]:
%%sql 
-- Event Wise Tally Of Gold Medals For Russia

SELECT "Year", COUNT(*) AS "Medals"
FROM summer
WHERE "Country" = 'RUS'AND "Medal" = 'Gold'
GROUP BY "Year"
ORDER BY "Year" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

5 rows affected.

+------+--------+
| Year | Medals |
+------+--------+
| 1996 |   36   |
| 2000 |   66   |
| 2004 |   47   |
| 2008 |   43   |
| 2012 |   47   |
+------+--------+

In [31]:
%%sql
# Without Sliding Frame

WITH Russia_Medals AS 
    (SELECT "Year", COUNT(*) AS "Medals"
        FROM summer
        WHERE "Country" = 'RUS'AND "Medal" = 'Gold'
        GROUP BY "Year"
        ORDER BY "Year" ASC)

SELECT "Year", "Medals",
        MAX("Medals") OVER (ORDER BY "Year" ASC) AS "Max_Medals_Running",
        # Specify Sliding Frame Of 2 Rows - Current & 1 Preceding Row
        MAX("Medals") OVER (ORDER BY "Year" ASC ROWS BETWEEN 1 PRECEDING AND CURRENT ROW) AS "Max_Medals_Last"

FROM Russia_Medals
ORDER BY "Year" ASC

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

5 rows affected.

+------+--------+--------------------+-----------------+
| Year | Medals | Max_Medals_Running | Max_Medals_Last |
+------+--------+--------------------+-----------------+
| 1996 |   36   |         36         |        36       |
| 2000 |   66   |         66         |        66       |
| 2004 |   47   |         66         |        66       |
| 2008 |   43   |         66         |        47       |
| 2012 |   47   |         66         |        47       |
+------+--------+--------------------+-----------------+

## **Moving Avg & Totals**

### **Source Table**

In [32]:
%%sql 
# Gold Medal Tally For USA Since 1980

SELECT "Year", COUNT(*) AS "Medals"
FROM summer
WHERE "Country" = 'USA' 
    AND "Medal" = 'Gold'
    AND "Year" >= 1980
GROUP BY "Year"
ORDER BY "Year" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

8 rows affected.

+------+--------+
| Year | Medals |
+------+--------+
| 1984 |  168   |
| 1988 |   77   |
| 1992 |   89   |
| 1996 |  160   |
| 2000 |  130   |
| 2004 |  116   |
| 2008 |  125   |
| 2012 |  147   |
+------+--------+

In [36]:
%%sql 

WITH US_Medals AS (
    SELECT "Year", COUNT(*) AS "Medals"
    FROM summer
    WHERE "Country" = 'USA' 
        AND "Medal" = 'Gold'
        AND "Year" >= 1980
    GROUP BY "Year"
    ORDER BY "Year" ASC)

# Moving Avg of Past 3 Olympic Events
SELECT "Year", "Medals",
    AVG("Medals") OVER (ORDER BY "Year" ASC ROWS BETWEEN 2 PRECEDING AND CURRENT ROW) AS "Medals_MA",
    SUM("Medals") OVER (ORDER BY "Year" ASC ROWS BETWEEN 2 PRECEDING AND CURRENT ROW) AS "Medals_MT"
FROM US_Medals
ORDER BY "Year" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

8 rows affected.

+------+--------+----------------------+-----------+
| Year | Medals |      Medals_MA       | Medals_MT |
+------+--------+----------------------+-----------+
| 1984 |  168   | 168.0000000000000000 |    168    |
| 1988 |   77   | 122.5000000000000000 |    245    |
| 1992 |   89   | 111.3333333333333333 |    334    |
| 1996 |  160   | 108.6666666666666667 |    326    |
| 2000 |  130   | 126.3333333333333333 |    379    |
| 2004 |  116   | 135.3333333333333333 |    406    |
| 2008 |  125   | 123.6666666666666667 |    371    |
| 2012 |  147   | 129.3333333333333333 |    388    |
+------+--------+----------------------+-----------+

# **04 Beyond Window Functions**

## **Pivot / Cross Table**

### **Query 01**

In [42]:
%%sql 
# Output In Long Format Without Pivot Table

SELECT "Country", "Year", COUNT(*) AS "Awards"
FROM summer
WHERE "Country" IN ('CHN', 'RUS', 'USA')
    AND "Year" IN (2008, 2012)
    AND "Medal" = 'Gold'
GROUP BY "Country", "Year"
ORDER BY "Country" ASC, "Year" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

6 rows affected.

+---------+------+--------+
| Country | Year | Awards |
+---------+------+--------+
|   CHN   | 2008 |   74   |
|   CHN   | 2012 |   56   |
|   RUS   | 2008 |   43   |
|   RUS   | 2012 |   47   |
|   USA   | 2008 |  125   |
|   USA   | 2012 |  147   |
+---------+------+--------+

In [48]:
%%sql 
# Output in Wide Format With CROSSTAB Function

CREATE EXTENSION IF NOT EXISTS tablefunc;

SELECT * FROM CROSSTAB($$
                        SELECT
                        "Country", "Year", COUNT(*) :: INTEGER AS "Awards"
                        FROM summer
                        WHERE "Country" IN ('CHN', 'RUS', 'USA')
                            AND "Year" IN (2008, 2012)
                            AND "Medal" = 'Gold'
                            GROUP BY "Country", "Year"
                            ORDER BY "Country" ASC, "Year" ASC;
                        $$) AS ct ("Country" VARCHAR, "2008" INTEGER, "2012" INTEGER)
ORDER BY "Country" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

RuntimeError: (psycopg2.errors.DatatypeMismatch) invalid return type
DETAIL:  SQL rowid datatype does not match return rowid datatype.

[SQL: SELECT * FROM CROSSTAB($$
                        SELECT
                        "Country", "Year", COUNT(*) :: INTEGER AS "Awards"
                        FROM summer
                        WHERE "Country" IN ('CHN', 'RUS', 'USA')
                            AND "Year" IN (2008, 2012)
                            AND "Medal" = 'Gold'
                            GROUP BY "Country", "Year"
                            ORDER BY "Country" ASC, "Year" ASC;
                        $$) AS ct ("Country" VARCHAR, "2008" INTEGER, "2012" INTEGER)
ORDER BY "Country" ASC;]
(Background on this error at: https://sqlalche.me/e/20/f405)
If you need help solving this issue, send us a message: https://ploomber.io/community

## **Roll Up**

## **Cube**

## **Coalesce**

## **String Agg Function**

In [53]:
%%sql 
# Without String Aggregation

WITH Country_Medals AS (
            SELECT "Country", COUNT(*) AS "Medals"
            FROM summer
            WHERE "Year" = 2012
                AND "Country" IN ('CHN', 'RUS', 'USA')
                AND "Medal" = 'Gold'
                AND "Sport" = 'Gymnastics'
            GROUP BY "Country")

SELECT "Country", RANK() OVER (ORDER BY "Medals" DESC) AS "Rank"
FROM Country_Medals
ORDER BY "Rank" ASC;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

3 rows affected.

+---------+------+
| Country | Rank |
+---------+------+
|   CHN   |  1   |
|   RUS   |  2   |
|   USA   |  3   |
+---------+------+

In [57]:
%%sql 
# With String Aggregation

WITH Country_Medals AS (
            SELECT "Country", COUNT(*) AS "Medals"
            FROM summer
            WHERE "Year" = 2012
                AND "Country" IN ('CHN', 'RUS', 'USA')
                AND "Medal" = 'Gold'
                AND "Sport" = 'Gymnastics'
            GROUP BY "Country"),

    Country_Rank AS (
            SELECT "Country", RANK() OVER (ORDER BY "Medals" DESC) AS "Rank"
            FROM Country_Medals
            ORDER BY "Rank" ASC)

SELECT STRING_AGG("Country", ', ')
FROM Country_Medals;

Running query in 'postgresql://postgres:***@localhost:5432/Summer_Olympics'

1 rows affected.

+---------------+
|   string_agg  |
+---------------+
| CHN, RUS, USA |
+---------------+